; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v11 ?v10)
             (pred_2 ?v5 ?v7)
             (pred_11 ?v11 ?v7)
             (pred_12 ?v2 ?v11 )
	     (pred_7 ?v11)
             (pred_9 ?v9)
             (pred_3 ?v5)
             (pred_5 ?v7)
             (pred_4 ?v11)
             (pred_10 ?v5)
             (pred_1 ?v11)
             (pred_6 ))



(:action op_2
:parameters (?v13 ?v12 ?v8 ?v6)
:precondition (and (pred_9 ?v13) (pred_9 ?v12) (pred_3 ?v8) (pred_5 ?v6)
          (pred_8 ?v13 ?v12) (pred_2 ?v8 ?v6)
                   (pred_11 ?v12 ?v6) (pred_7 ?v13) 
                   (pred_4 ?v12) (pred_10 ?v8))
:effect (and  (pred_1 ?v12) (not (pred_4 ?v12))))


(:action op_5
:parameters (?v13 ?v4)
:precondition (and (pred_9 ?v13) (pred_9 ?v4)
               (pred_7 ?v13) (pred_8 ?v13 ?v4) (pred_1 ?v4))
:effect (and (pred_7 ?v4) (not (pred_7 ?v13))))

(:action op_1
:parameters (?v13 ?v8)
:precondition (and (pred_9 ?v13) (pred_3 ?v8) 
                  (pred_7 ?v13) (pred_12 ?v8 ?v13) (pred_6 ))
:effect (and (pred_10 ?v8)
   (not (pred_12 ?v8 ?v13)) (not (pred_6 ))))


(:action op_4
:parameters (?v13 ?v3 ?v1)
:precondition (and (pred_9 ?v13) (pred_3 ?v3) (pred_3 ?v1)
                  (pred_7 ?v13) (pred_10 ?v1) (pred_12 ?v3 ?v13))
:effect (and (pred_10 ?v3) (pred_12 ?v1 ?v13)
        (not (pred_10 ?v1)) (not (pred_12 ?v3 ?v13))))

(:action op_3
:parameters (?v13 ?v8)
:precondition (and (pred_9 ?v13) (pred_3 ?v8) 
                  (pred_7 ?v13) (pred_10 ?v8))
:effect (and (pred_6 ) (pred_12 ?v8 ?v13) (not (pred_10 ?v8)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_20 obj_19 obj_17 obj_01 obj_07 obj_14 obj_09 obj_18 obj_15 obj_03 obj_04 obj_02 obj_10 obj_16 obj_06 obj_11
    obj_12 obj_05
    obj_13 obj_08
    )

    (:init
       (pred_6)

       (pred_9 obj_20)
       (pred_9 obj_19)
       (pred_9 obj_17)
       (pred_9 obj_01)
       (pred_9 obj_07)
       (pred_9 obj_14)
       (pred_9 obj_09)
       (pred_9 obj_18)
       (pred_9 obj_15)
       (pred_9 obj_03)
       (pred_9 obj_04)
       (pred_9 obj_02)
       (pred_9 obj_10)
       (pred_9 obj_16)
       (pred_9 obj_06)
       (pred_9 obj_11)
       (pred_5 obj_12)
       (pred_5 obj_05)
       (pred_3 obj_13)
       (pred_3 obj_08)

       (pred_8 obj_20 obj_07)
       (pred_8 obj_20 obj_19)
       (pred_8 obj_19 obj_14)
       (pred_8 obj_19 obj_17)
       (pred_8 obj_19 obj_20)
       (pred_8 obj_17 obj_09)
       (pred_8 obj_17 obj_01)
       (pred_8 obj_17 obj_19)
       (pred_8 obj_01 obj_18)
       (pred_8 obj_01 obj_17)
       (pred_8 obj_07 obj_15)
       (pred_8 obj_07 obj_14)
       (pred_8 obj_07 obj_20)
       (pred_8 obj_14 obj_03)
       (pred_8 obj_14 obj_09)
       (pred_8 obj_14 obj_19)
       (pred_8 obj_14 obj_07)
       (pred_8 obj_09 obj_04)
       (pred_8 obj_09 obj_18)
       (pred_8 obj_09 obj_17)
       (pred_8 obj_09 obj_14)
       (pred_8 obj_18 obj_02)
       (pred_8 obj_18 obj_01)
       (pred_8 obj_18 obj_09)
       (pred_8 obj_15 obj_10)
       (pred_8 obj_15 obj_03)
       (pred_8 obj_15 obj_07)
       (pred_8 obj_03 obj_16)
       (pred_8 obj_03 obj_04)
       (pred_8 obj_03 obj_14)
       (pred_8 obj_03 obj_15)
       (pred_8 obj_04 obj_06)
       (pred_8 obj_04 obj_02)
       (pred_8 obj_04 obj_09)
       (pred_8 obj_04 obj_03)
       (pred_8 obj_02 obj_11)
       (pred_8 obj_02 obj_18)
       (pred_8 obj_02 obj_04)
       (pred_8 obj_10 obj_16)
       (pred_8 obj_10 obj_15)
       (pred_8 obj_16 obj_06)
       (pred_8 obj_16 obj_03)
       (pred_8 obj_16 obj_10)
       (pred_8 obj_06 obj_11)
       (pred_8 obj_06 obj_04)
       (pred_8 obj_06 obj_16)
       (pred_8 obj_11 obj_02)
       (pred_8 obj_11 obj_06)
       (pred_4 obj_16)
       (pred_4 obj_18)
       (pred_11  obj_16 obj_12)
       (pred_11  obj_18 obj_05)
       (pred_1 obj_20)
       (pred_1 obj_19)
       (pred_1 obj_17)
       (pred_1 obj_01)
       (pred_1 obj_07)
       (pred_1 obj_14)
       (pred_1 obj_09)
       (pred_1 obj_15)
       (pred_1 obj_03)
       (pred_1 obj_04)
       (pred_1 obj_02)
       (pred_1 obj_10)
       (pred_1 obj_06)
       (pred_1 obj_11)

       (pred_2  obj_13 obj_12)
       (pred_2  obj_08 obj_05)
       (pred_12 obj_13 obj_06)
       (pred_12 obj_08 obj_06)
       (pred_7 obj_02)
    )

    (:goal (and
       (pred_12 obj_13 obj_10)
    ))
(:constraints
  (always (not (pred_7 obj_16)))
)
)

; plan
1. (op_5 obj_02 obj_04)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_04)
   goals met: 0 of 1
2. (op_5 obj_04 obj_06)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_06)
   goals met: 0 of 1
3. (op_1 obj_06 obj_13)
   deleted: (pred_12 obj_13 obj_06) (pred_6)
   added: (pred_10 obj_13)
   goals met: 0 of 1
4. (op_5 obj_06 obj_04)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_04)
   goals met: 0 of 1
5. (op_5 obj_04 obj_03)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_03)
   goals met: 0 of 1
6. (op_5 obj_03 obj_15)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_15)
   goals met: 0 of 1
7. (op_5 obj_15 obj_10)
   deleted: (pred_7 obj_15)
   added: (pred_7 obj_10)
   goals met: 0 of 1
8. (op_3 obj_10 obj_13)
   deleted: (pred_10 obj_13)
   added: (pred_6) (pred_12 obj_13 obj_10)
   goals met: 1 of 1
